---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.MEPSupportFailures
source: html/29d3e5a3-dc88-0ddb-d9d7-e5fec2f7b123.htm
---
# BuiltInFailures.MEPSupportFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.